//USUARIOF JOB CLASS=A,MSGCLASS=O,MSGLEVEL=(1,1),NOTIFY=&SYSUID 
//*------------------------------------------------------------
//JCLLIB   JCLLIB ORDER=ORIGEN.CURSOS.PROCLIB 
//STEP1    EXEC COMPDB2, 
//         ALUMLIB=USUARIO.CURSOS, 
//         GOPGM=PGMB4CAF 
//PC.SYSLIB  DD DSN=USUARIO.CURSOS.DCLGEN,DISP=SHR 
//COB.SYSLIB DD DSN=ORIGEN.COPYLIB,DISP=SHR 