 //COMPTEST JOB CLASS=A,MSGCLASS=O,MSGLEVEL=(0,0),NOTIFY=&SYSUID, 
 //             TIME=(,3) 
 //JCLLIB   JCLLIB ORDER=USUARIO.CURSOS.PROCLIB 
//*--------------------------------------------------------------
 //STEP1    EXEC COMPCOTE, 
 //         ALUMLIB=USUARIO.CURSOS, 
 //         GOPGM=PGMB2CAF 
 //COBOL.SYSLIB DD DSN=ORIGEN.COPYLIB,DISP=SHR 